//FUZZJOB  JOB
//STEP1    EXEC PGM=QTYSUM
//INFILE   DD DSN=MY.INPUT,DISP=SHR
//STEP2    EXEC PGM=PARMSUM,PARM='00001',COND=EVEN
//STEP3    EXEC PGM=CARDSUM,COND=EVEN
//SYSIN    DD *
00042
/*
