         PCB   TYPE=TP,MODIFY=YES
         PCB   TYPE=DB,DBDNAME=ORDERDB,KEYLEN=16
         SENSEG NAME=ORDER
         SENSEG NAME=LINE,PARENT=ORDER
         PSBGEN PSBNAME=ORDUPD,LANG=COBOL
         END
