       IDENTIFICATION DIVISION.
       PROGRAM-ID. CARDSUM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-CARD PIC X(5).
       01 WS-NUM REDEFINES WS-CARD PIC 9(5).
       01 WS-TOTAL PIC 9(9) VALUE 0.
       PROCEDURE DIVISION.
           ACCEPT WS-CARD
           ADD WS-NUM TO WS-TOTAL
           GOBACK.
