*> Copyright (c) 2026 Example. Redistribution and use in source and binary forms, with or
*> without modification, are permitted provided that the following conditions are met:
*> 1. Redistributions of source code must retain the above copyright notice, this list of
*>    conditions and the following disclaimer in the documentation provided with it.
*> 2. Neither the name of the project nor the names of its contributors may be used to
*>    endorse products derived from this software without specific prior written consent.
       IDENTIFICATION DIVISION.
       PROGRAM-ID. NTEST.
       PROCEDURE DIVISION.
           GOBACK.
