       IDENTIFICATION DIVISION.
       PROGRAM-ID. C2.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-PGM           PIC X(8).
       LINKAGE SECTION.
       01 DFHCOMMAREA      PIC X(100).
       PROCEDURE DIVISION.
           MOVE DFHCOMMAREA TO WS-PGM
           EXEC CICS XCTL PROGRAM(WS-PGM) END-EXEC
           EXEC CICS RETURN END-EXEC.
