       IDENTIFICATION DIVISION.
       PROGRAM-ID. P1.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-IN            PIC X(80).
       01 WS-CMD           PIC X(80).
       PROCEDURE DIVISION.
           ACCEPT WS-IN FROM COMMAND-LINE
           MOVE WS-IN TO WS-CMD
           CALL 'P2' USING WS-CMD
           GOBACK.
