       IDENTIFICATION DIVISION.
       PROGRAM-ID. P2.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-LOCAL         PIC X(120).
       LINKAGE SECTION.
       01 LK-CMD           PIC X(80).
       PROCEDURE DIVISION USING LK-CMD.
           MOVE LK-CMD TO WS-LOCAL
           CALL 'SYSTEM' USING WS-LOCAL
           GOBACK.
