       IDENTIFICATION DIVISION.
       PROGRAM-ID. JOBSUB.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-INPUT.
          05 WS-ACCT          PIC X(10).
       01 JCL-RECORD          PIC X(80).
       01 WS-LOG              PIC X(80).
       PROCEDURE DIVISION.
           EXEC CICS RECEIVE INTO(WS-INPUT) END-EXEC
           STRING '//STEP1 EXEC PGM=RPT,PARM=' WS-ACCT
              DELIMITED BY SIZE INTO JCL-RECORD
           EXEC CICS WRITEQ TD QUEUE('JOBS') FROM(JCL-RECORD)
                LENGTH(80) END-EXEC
           MOVE WS-ACCT TO WS-LOG
           EXEC CICS WRITEQ TD QUEUE('LOGQ') FROM(WS-LOG)
                LENGTH(80) END-EXEC
           EXEC CICS RETURN END-EXEC.
