       IDENTIFICATION DIVISION.
       PROGRAM-ID. CPYDOT.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY DOTWS.WS.
       PROCEDURE DIVISION.
       MAIN-PARA.
           PERFORM NEXT-PARA
           GOBACK.
       SHOW-STATUS.
           COPY DOTPROC.
       NEXT-PARA.
           DISPLAY WS-STATUS.
