       IDENTIFICATION DIVISION.
       PROGRAM-ID. CPYTAG.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  BASEB.
           COPY TAGLIT REPLACING 'X' BY BASEB.
       01  COTIS.
           COPY TAGLIT REPLACING 'X' BY COTIS.
           COPY TAGPAR REPLACING ==()== BY ==FILEIN==.
       PROCEDURE DIVISION.
       MAIN-PARA.
           MOVE BASEB-CODE TO COTIS-CODE
           MOVE FILEIN-KEY TO BASEB-NAME
           DISPLAY FS-FILEIN BASEB-FLAG
           GOBACK.
