       IDENTIFICATION DIVISION.
       PROGRAM-ID. DBGITEM.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. X WITH DEBUGGING MODE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-A                 PIC X(4).
       PROCEDURE DIVISION.
       DECLARATIVES.
       DEBUG-SECTION SECTION.
           USE FOR DEBUGGING ON ALL PROCEDURES.
       DEBUG-PARA.
           DISPLAY DEBUG-LINE DEBUG-NAME DEBUG-CONTENTS.
       END DECLARATIVES.
       MAIN-SECTION SECTION.
       MAIN-PARA.
           MOVE "X" TO WS-A
           STOP RUN.
