       IDENTIFICATION DIVISION.
       PROGRAM-ID. DEBUGMD.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-390 WITH DEBUGGING MODE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-DEBUG-AREA.
      D    05  WS-DEBUG-MSG        PIC X(80).
      D    05  WS-DEBUG-COUNTER    PIC 9(6) VALUE ZEROS.
           05  WS-ALWAYS           PIC X(6).
       01  WS-BIG                  PIC X(95).
       PROCEDURE DIVISION.
       DECLARATIVES.
       DBG SECTION.
           USE FOR DEBUGGING ON ALL REFERENCES OF WS-BIG.
       DBG-1.
           DISPLAY DEBUG-NAME.
       END DECLARATIVES.
       MAIN-LINE.
      D    MOVE 'ENTERING' TO WS-DEBUG-MSG
           MOVE SPACES TO WS-ALWAYS WS-BIG
           STOP RUN.
