       IDENTIFICATION DIVISION.
       PROGRAM-ID. IDCOMM.
       AUTHOR. O'BRIEN, WHO WROTE IT.
       DATE-WRITTEN. JANUARY 1983.
               You should have received a copy of the licence.
               It's free software. COPY nothing from here.
       SECURITY.
               None, "really.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-A PIC X.
       PROCEDURE DIVISION.
       MAIN-PARA.
           DISPLAY WS-A
           GOBACK.
