       IDENTIFICATION DIVISION.
       PROGRAM-ID. NESTREPL.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 REC.
       COPY NESTMID REPLACING LEADING ==AA== BY ==XX==.
       PROCEDURE DIVISION.
           MOVE "A" TO XX-ONE XX-LEAF1 AA-TWO-ID XX-THREE.
           DISPLAY REC.
           STOP RUN.
