       IDENTIFICATION DIVISION.
       PROGRAM-ID. OCC.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       78 BIGN VALUE 65536.
       01 E1 PIC X OCCURS 5.
       01 G1.
          05 G1-E PIC X(2) OCCURS 3.
       01 BIGTAB.
          05 BIG-E USAGE POINTER OCCURS BIGN.
       01 CONSTPIC PIC X(BIGN).
       01 R0 PIC X(10).
       01 R1 REDEFINES R0.
          05 R1-A PIC X(4) OCCURS 6.
       PROCEDURE DIVISION.
           DISPLAY E1(1) G1-E(1) BIG-E(1) CONSTPIC R1-A(1).
           GOBACK.
