SEQ001 >>DEFINE CONSTANT QTY 10
LOCAL  >>DEFINE CONSTANT QTY 20 OVERRIDE
SEQ003 >>DEFINE CONSTANT KEEP 3
       IDENTIFICATION DIVISION.
       PROGRAM-ID. R1.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 T1.
          05 T1-E PIC X(4) OCCURS QTY TIMES.
       01 T2.
          05 T2-E PIC X(2) OCCURS KEEP TIMES.
GC0712 >>IF QTY < 15
       01 BR-A PIC X(1).
GC0712 >>ELIF QTY > 15
       01 BR-B PIC X(2).
GC0712 >>ELSE
       01 BR-C PIC X(3).
GC0712 >>END-IF
       >>IF NOSUCHNAME IS DEFINED
       01 ND-A PIC X(5).
       >>ELSE
       01 ND-B PIC X(6).
       >>END-IF
       PROCEDURE DIVISION.
           GOBACK.
