       IDENTIFICATION DIVISION.
       PROGRAM-ID. R4.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-DIA PIC 99.
       01 WS-ANO PIC 9(4).
       SCREEN SECTION.
       01 SC.
          05 LINE 1 COLUMN 1 VALUE 'AB'.
          05 LINE 1 COLUMN 5 USING WS-DIA.
          05 LINE 1 COLUMN 8 FROM WS-ANO.
          05 LINE 2 COLUMN 1.
          05 SC-X LINE 3 COLUMN 1 PIC X(6) TO WS-DIA.
       PROCEDURE DIVISION.
           DISPLAY SC ACCEPT SC.
           GOBACK.
