       IDENTIFICATION DIVISION.
       PROGRAM-ID. SAMEAREA.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT OUT-FILE ASSIGN TO "O".
           SELECT IN-FILE ASSIGN TO "I".
       I-O-CONTROL.
           SAME RECORD AREA FOR IN-FILE, OUT-FILE.
       DATA DIVISION.
       FILE SECTION.
       FD  OUT-FILE.
       01  OUT-RECORD          PIC X(300).
       FD  IN-FILE.
       01  IN-RECORD           PIC X(300).
           88  DELETED-RECORD  VALUE LOW-VALUES.
       WORKING-STORAGE SECTION.
       01  WS-COUNT            PIC 9(4).
       PROCEDURE DIVISION.
           OPEN INPUT IN-FILE OUTPUT OUT-FILE
           READ IN-FILE
           IF DELETED-RECORD ADD 1 TO WS-COUNT END-IF
           WRITE OUT-RECORD
           STOP RUN.
