       IDENTIFICATION DIVISION.
       PROGRAM-ID. SQLINC.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-COMMAREA.
           EXEC SQL
             INCLUDE SQLINCA
           END-EXEC.
           EXEC SQL INCLUDE SQLINCB END-EXEC.
       PROCEDURE DIVISION.
       MAIN-PARA.
           MOVE CUST-ID TO CA-CUSTOMER-NUM
           PERFORM SHARED-ERROR
           GOBACK.
           EXEC SQL INCLUDE SQLINCP END-EXEC.
