           05  'X'-CLE.
             10 'X'-CODE                  PIC 9(004).
             10 'X'-NAME                  PIC X(010).
           05  'X'-FLAG                   PIC X VALUE SPACE.
