       IDENTIFICATION DIVISION.
       PROGRAM-ID. OCC3.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 A-PTR USAGE POINTER OCCURS 3.
       01 A-PPTR USAGE PROGRAM-POINTER OCCURS 3.
       01 A-BL USAGE BINARY-LONG OCCURS 3.
       01 A-IDX USAGE INDEX OCCURS 3.
       01 A-C1 USAGE COMP-1 OCCURS 3.
       01 G.
          05 G-PTR USAGE POINTER OCCURS 3.
          05 G-PPTR USAGE PROGRAM-POINTER OCCURS 3.
          05 G-BL USAGE BINARY-LONG OCCURS 3.
       PROCEDURE DIVISION.
           SET A-PTR(1) TO NULL SET G-PTR(1) TO NULL
           SET A-PPTR(1) TO ENTRY "X" SET G-PPTR(1) TO ENTRY "X"
           MOVE 1 TO A-BL(1) G-BL(1)
           SET A-IDX(1) TO 1
           MOVE 1 TO A-C1(1).
           GOBACK.
