       IDENTIFICATION DIVISION.
       PROGRAM-ID. ENVGUARD.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-PGM      PIC X(8).
       PROCEDURE DIVISION.
           ACCEPT WS-PGM FROM ENVIRONMENT 'TARGET'
               ON EXCEPTION MOVE 'DEFAULT' TO WS-PGM
           END-ACCEPT
           CALL WS-PGM
           GOBACK.
