       IDENTIFICATION DIVISION.
       PROGRAM-ID. ENVLOAD.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-PGM      PIC X(8).
       PROCEDURE DIVISION.
           ACCEPT WS-PGM FROM ENVIRONMENT 'TARGET'
           CALL WS-PGM
           GOBACK.
