         DBD   NAME=ORDERDB,ACCESS=(HIDAM,VSAM)
         SEGM  NAME=ORDER,PARENT=0,BYTES=100
         FIELD NAME=(ORDNO,SEQ,U),BYTES=10,START=1
         SEGM  NAME=ITEM,PARENT=ORDER,BYTES=60
         FIELD NAME=(ITEMNO,SEQ,U),BYTES=6,START=1
         DBDGEN
         FINISH
         END
