       IDENTIFICATION DIVISION.
       PROGRAM-ID. CARDCPY.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT CARD-FILE ASSIGN TO CARDS.
           SELECT CTL-FILE ASSIGN TO CTLOUT.
       DATA DIVISION.
       FILE SECTION.
       FD CARD-FILE RECORD CONTAINS 80 CHARACTERS.
       01 CARD-REC PIC X(80).
       FD CTL-FILE RECORD CONTAINS 80 CHARACTERS.
       01 CTL-REC PIC X(80).
       PROCEDURE DIVISION.
           OPEN INPUT CARD-FILE OUTPUT CTL-FILE
           READ CARD-FILE
           MOVE CARD-REC TO CTL-REC
           WRITE CTL-REC
           CLOSE CARD-FILE CTL-FILE
           GOBACK.
