//CTLJOB   JOB (ACCT),'LABEL FIXTURE'
//STEP010  EXEC PGM=CARDCPY
//CARDS    DD *
00003
/*
//CTLOUT   DD DSN=CWJOB.CTL.DATA,DISP=(NEW,CATLG,DELETE)
//STEP020  EXEC PGM=CTLUSE,COND=(0,NE,STEP010)
//CTLIN    DD DSN=CWJOB.CTL.DATA,DISP=SHR
//HISTIN   DD DSN=CWJOB.HIST(0),DISP=SHR
//REFIN    DD DSN=CWJOB.REF.MASTER,DISP=SHR
//PARMIN   DD *
LOADPGM100012
/*
