       IDENTIFICATION DIVISION.
       PROGRAM-ID. INSTRM.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT CTL-FILE ASSIGN TO CTLIN.
       DATA DIVISION.
       FILE SECTION.
       FD CTL-FILE.
       01 CTL-REC PIC X(80).
       WORKING-STORAGE SECTION.
       01 WS-REC.
          05 WS-PGM PIC X(8).
          05 FILLER PIC X(72).
       01 WS-TOTAL PIC S9(15)V9(05) VALUE 0.
       PROCEDURE DIVISION.
           OPEN INPUT CTL-FILE
           READ CTL-FILE
           MOVE CTL-REC TO WS-REC
           CALL WS-PGM ON EXCEPTION CONTINUE END-CALL
           CLOSE CTL-FILE
           GOBACK.
