//RACFUNL  JOB (ACCT),'UNLOAD',CLASS=A,USER=SECADM
//DBU      EXEC PGM=IRRDBU00,PARM='NOLOCKINPUT'
//SYSPRINT DD SYSOUT=*
//INDD1    DD DSN=SYS1.RACFDS,DISP=SHR
//OUTDD    DD DSN=PUBLIC.RACF.UNLOAD,DISP=(NEW,CATLG)
//STEPLIB  DD DSN=SYS1.LINKLIB,DISP=SHR
