       IDENTIFICATION DIVISION.
       PROGRAM-ID. CUTPGM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-IN.
          05 FILLER PIC X(8).
          05 FILLER PIC X(2).
          05 WS-AT PIC 9(2).
          05 FILLER PIC X(68).
       01 WS-LEN PIC S9(4) COMP VALUE 80.
       01 WS-TEXT PIC X(20) VALUE 'ABCDEFGHIJKLMNOPQRST'.
       01 WS-OUT PIC X(4).
       PROCEDURE DIVISION.
           EXEC CICS RECEIVE INTO(WS-IN) LENGTH(WS-LEN)
           END-EXEC
           MOVE WS-TEXT(WS-AT:1) TO WS-OUT
           EXEC CICS RETURN END-EXEC.
