       IDENTIFICATION DIVISION.
       PROGRAM-ID. DAYA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY SHARED.
       PROCEDURE DIVISION.
           ACCEPT CPY-IDX FROM COMMAND-LINE
           DISPLAY CPY-IDX
           GOBACK.
