       IDENTIFICATION DIVISION.
       PROGRAM-ID. DAYB.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY SHARED.
       PROCEDURE DIVISION.
           MOVE CPY-CELL(CPY-IDX) TO CPY-CELL(1)
           GOBACK.
