       IDENTIFICATION DIVISION.
       PROGRAM-ID. LOGIN.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-DB-PASSWORD      PIC X(16) VALUE 'Tr0ub4dor3xQz9'.
       01 WS-API-TOKEN        PIC X(20) VALUE "ghx8Kq2LmPz7Rt4Vw9Ys".
       PROCEDURE DIVISION.
           EXEC SQL CONNECT TO SAMPLE USER 'DB2ADM' USING 'Pa55w0rdZ9q' END-EXEC.
           EXEC CICS SIGNON USERID('OPER01') PASSWORD('S3CR3T01') END-EXEC.
           EXEC CICS CHANGE PASSWORD('OLDPW001') NEWPASSWORD('NEWPW002')
                USERID('OPER01') END-EXEC.
           EXEC SQL CONNECT 'SCOTT' IDENTIFIED BY 'T1ger7Q2' END-EXEC.
           STOP RUN.
