//PAYROLL  JOB (ACCT),'RUN',CLASS=A,MSGCLASS=X,USER=PAYADM,PASSWORD=K7QX2MPL
//STEP1    EXEC PGM=IKJEFT01
//SYSTSIN  DD *
  LOGON PAYADM/Q2W3E4R5
  ALU PAYADM PASSWORD(NEWPW123) NOEXPIRED
/*
//STEP2    EXEC PGM=FTPXFER,PARM='USER=OPS,PASSWORD=M4INFR4M'
