       IDENTIFICATION DIVISION.
       PROGRAM-ID. ADDQTY.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-TOTAL PIC 9(9) VALUE 0.
       LINKAGE SECTION.
       01  QTY-REC.
           05 QTY PIC 9(5).
       01  NOTE-REC PIC X(8).
       PROCEDURE DIVISION USING QTY-REC NOTE-REC.
           IF ADDRESS OF NOTE-REC NOT = NULL
              DISPLAY NOTE-REC
           END-IF
           ADD QTY TO WS-TOTAL
           GOBACK.
