       IDENTIFICATION DIVISION.
       PROGRAM-ID. MAINP.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-QTY PIC 9(5) VALUE 1.
       PROCEDURE DIVISION.
           CALL 'ADDQTY' USING WS-QTY OMITTED
           GOBACK.
