//CSDLOAD  JOB (ACCT),'CSD',CLASS=A
//STEP1    EXEC PGM=DFHCSDUP
//STEPLIB  DD DSN=CICS.SDFHLOAD,DISP=SHR
//DFHCSD   DD DSN=CICS.DFHCSD,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
 DEFINE TDQUEUE(JOBS) GROUP(APP)
        TYPE(EXTRA) DDNAME(INREADER)
/*
