       IDENTIFICATION DIVISION.
       PROGRAM-ID. DRIVER.
       PROCEDURE DIVISION.
           CALL 'APROG'
           CALL 'BPROG'
           GOBACK.
