       IDENTIFICATION DIVISION.
       PROGRAM-ID. QTYPGM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-IN.
          05 FILLER PIC X(8).
          05 WS-QTY PIC 9(5).
          05 FILLER PIC X(67).
       01 WS-LEN PIC S9(4) COMP VALUE 80.
       01 WS-TOTAL PIC 9(7) VALUE 0.
       PROCEDURE DIVISION.
           EXEC CICS RECEIVE INTO(WS-IN) LENGTH(WS-LEN)
           END-EXEC
           COMPUTE WS-TOTAL = WS-TOTAL + WS-QTY
           EXEC CICS RETURN END-EXEC.
