       IDENTIFICATION DIVISION.
       PROGRAM-ID. RAWPGM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-IN PIC X(80).
       01 WS-LEN PIC S9(4) COMP VALUE 80.
       01 WS-PGM PIC X(8).
       01 WS-RESP PIC S9(8) COMP.
       PROCEDURE DIVISION.
           EXEC CICS RECEIVE INTO(WS-IN) LENGTH(WS-LEN)
           END-EXEC
           MOVE WS-IN(9:8) TO WS-PGM
           EXEC CICS LINK PROGRAM(WS-PGM) RESP(WS-RESP)
           END-EXEC
           EXEC CICS RETURN END-EXEC.
