       IDENTIFICATION DIVISION.
       PROGRAM-ID. CLEN.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-AREA          PIC X(100).
       01 WS-PGM           PIC X(8).
       PROCEDURE DIVISION.
           EXEC CICS LINK PROGRAM('CCALLEE') COMMAREA(WS-AREA)
               LENGTH(200) END-EXEC
           EXEC CICS XCTL PROGRAM(WS-PGM) END-EXEC
           EXEC CICS RETURN END-EXEC.
