       IDENTIFICATION DIVISION.
       PROGRAM-ID. OBSOLETE.
       AUTHOR. A PROGRAMMER.
       INSTALLATION. HEAD OFFICE.
       DATE-WRITTEN. 1987-01-02.
       DATE-COMPILED.
       SECURITY. NONE.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-370 WITH DEBUGGING MODE.
       OBJECT-COMPUTER. IBM-370 MEMORY SIZE 8000 CHARACTERS.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT IN-FILE ASSIGN TO INDD.
           SELECT OUT-FILE ASSIGN TO OUTDD.
       I-O-CONTROL.
           RERUN ON CHKPT EVERY 1000 RECORDS OF IN-FILE
           MULTIPLE FILE TAPE CONTAINS IN-FILE OUT-FILE.
       DATA DIVISION.
       FILE SECTION.
       FD  IN-FILE
           LABEL RECORDS ARE STANDARD
           VALUE OF FILE-ID IS WS-NAME
           DATA RECORD IS IN-REC.
       01  IN-REC PIC X(80).
       FD  OUT-FILE.
       01  OUT-REC PIC X(80).
       WORKING-STORAGE SECTION.
       01  WS-NAME PIC X(8) VALUE 'X'.
       PROCEDURE DIVISION.
       DECLARATIVES.
       DEBUG-SECT SECTION.
           USE FOR DEBUGGING ON MAIN-PARA.
       DEBUG-PARA.
           DISPLAY DEBUG-ITEM.
       END DECLARATIVES.
       MAIN-SECT SECTION 60.
       MAIN-PARA.
           OPEN INPUT IN-FILE REVERSED.
           OPEN OUTPUT OUT-FILE.
           ENTER ASSEMBLER.
           STOP 'MOUNT THE NEXT TAPE'.
           WRITE OUT-REC FROM IN-REC.
           CLOSE IN-FILE OUT-FILE.
           GO TO MAIN-EXIT.
       MAIN-EXIT.
           GOBACK.
