       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALLA.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY SHARED.
       PROCEDURE DIVISION.
           ACCEPT CPY-IDX FROM COMMAND-LINE
           CALL 'CALLB' USING CPY-IDX
           GOBACK.
