       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALLB.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY SHARED.
       LINKAGE SECTION.
       01 LK-IDX           PIC 9(4).
       PROCEDURE DIVISION USING LK-IDX.
           MOVE CPY-CELL(LK-IDX) TO CPY-CELL(1)
           GOBACK.
