ORDSET   DFHMSD TYPE=&SYSPARM,MODE=INOUT,LANG=COBOL,STORAGE=AUTO,      X
               CTRL=(FREEKB,FRSET)
ORDMAP   DFHMDI SIZE=(24,80),LINE=1,COLUMN=1
         DFHMDF POS=(3,1),LENGTH=9,ATTRB=ASKIP,INITIAL='CUSTOMER:'
CUST     DFHMDF POS=(3,11),LENGTH=8,ATTRB=(UNPROT,IC)
         DFHMDF POS=(3,20),LENGTH=1,ATTRB=ASKIP
QTY      DFHMDF POS=(4,11),LENGTH=3,ATTRB=(UNPROT,NUM),PICIN='999'
         DFHMDF POS=(4,15),LENGTH=1,ATTRB=ASKIP
         DFHMSD TYPE=FINAL
         END
