       IDENTIFICATION DIVISION.
       PROGRAM-ID. ARGFILE.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT OUT-FILE ASSIGN TO WS-NAME
               FILE STATUS IS WS-FS.
       DATA DIVISION.
       FILE SECTION.
       FD  OUT-FILE.
       01  OUT-REC     PIC X(80).
       WORKING-STORAGE SECTION.
       01  WS-NAME     PIC X(8).
       01  WS-FS       PIC XX.
       PROCEDURE DIVISION.
           ACCEPT WS-NAME FROM COMMAND-LINE
           OPEN OUTPUT OUT-FILE
           DISPLAY 'STATUS ' WS-FS
           GOBACK.
