       IDENTIFICATION DIVISION.
       PROGRAM-ID. CICSREAD.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  WS-FILE     PIC X(8).
       01  WS-REC      PIC X(80).
       01  WS-LEN      PIC S9(4) COMP VALUE 8.
       PROCEDURE DIVISION.
           EXEC CICS RECEIVE INTO(WS-FILE) LENGTH(WS-LEN) END-EXEC
           EXEC CICS READ FILE(WS-FILE) INTO(WS-REC) RIDFLD(WS-FILE)
           END-EXEC
           EXEC CICS RETURN END-EXEC.
