       IDENTIFICATION DIVISION.
       PROGRAM-ID. COLLSEQ.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       OBJECT-COMPUTER. IBM-ZSERIES
           PROGRAM COLLATING SEQUENCE IS ASCII-ORDER.
       SPECIAL-NAMES.
           ALPHABET ASCII-ORDER IS STANDARD-1.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-CODE    PIC X.
          88 CODE-ALNUM   VALUE 'A' THRU '9'.
       PROCEDURE DIVISION.
           GOBACK.
