       01  NAMEMI.
           02  FILLER PIC X(12).
           02  NAMEL  COMP PIC S9(4).
           02  NAMEF  PIC X.
           02  FILLER REDEFINES NAMEF.
               03  NAMEA  PIC X.
           02  NAMEI  PIC X(12).
       01  NAMEMO REDEFINES NAMEMI.
           02  FILLER PIC X(12).
           02  FILLER PIC X(3).
           02  NAMEO  PIC X(12).
