       IDENTIFICATION DIVISION.
       PROGRAM-ID. NAMEPGM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY NAMEMS.
       01 WS-MSG PIC X(12).
       01 WS-STATE PIC X VALUE 'S'.
       LINKAGE SECTION.
       01 DFHCOMMAREA PIC X.
       PROCEDURE DIVISION.
           IF EIBCALEN = 0
               MOVE LOW-VALUES TO NAMEMO
               EXEC CICS SEND MAP('NAMEM') MAPSET('NAMEMS') ERASE
               END-EXEC
               EXEC CICS RETURN TRANSID('NAME') COMMAREA(WS-STATE)
               END-EXEC
           END-IF
           EXEC CICS RECEIVE MAP('NAMEM') MAPSET('NAMEMS')
               INTO(NAMEMI) END-EXEC
           MOVE NAMEI TO WS-MSG
           EXEC CICS WRITEQ TD QUEUE('LOGQ') FROM(WS-MSG)
           END-EXEC
           EXEC CICS RETURN END-EXEC.
