NAMEMS   DFHMSD TYPE=&SYSPARM,MODE=INOUT,LANG=COBOL,TIOAPFX=YES
NAMEM    DFHMDI SIZE=(24,80),LINE=1,COLUMN=1
         DFHMDF POS=(1,1),LENGTH=10,ATTRB=(ASKIP,BRT),INITIAL='NAME ENTRY'
         DFHMDF POS=(3,1),LENGTH=5,ATTRB=ASKIP,INITIAL='NAME:'
NAME     DFHMDF POS=(3,7),LENGTH=12,ATTRB=(UNPROT,IC)
         DFHMDF POS=(3,20),LENGTH=1,ATTRB=ASKIP
         DFHMSD TYPE=FINAL
         END
