       IDENTIFICATION DIVISION.
       PROGRAM-ID. MAINB.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-IN            PIC 9(4).
       PROCEDURE DIVISION.
           ACCEPT WS-IN FROM COMMAND-LINE
           CALL 'HELPER' USING WS-IN
           GOBACK.
       END PROGRAM MAINB.
       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELPER.
       DATA DIVISION.
       LINKAGE SECTION.
       01 LK-IDX           PIC 9(4).
       PROCEDURE DIVISION USING LK-IDX.
           DISPLAY LK-IDX
           GOBACK.
       END PROGRAM HELPER.
