       IDENTIFICATION DIVISION.
       PROGRAM-ID. LATERPGM.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT CTL-FILE ASSIGN TO CTLIN.
       DATA DIVISION.
       FILE SECTION.
       FD CTL-FILE RECORD CONTAINS 80 CHARACTERS.
       01 CTL-REC PIC X(80).
       WORKING-STORAGE SECTION.
       01 WS-REC.
          05 WS-PGM PIC X(8).
          05 FILLER PIC X(72).
       PROCEDURE DIVISION.
           OPEN INPUT CTL-FILE
           READ CTL-FILE INTO WS-REC
           CALL WS-PGM ON EXCEPTION CONTINUE END-CALL
           CLOSE CTL-FILE
           GOBACK.
