//LATERJOB JOB (ACCT)
//         IF (RC = 0) THEN
//STEP010  EXEC PGM=LATERPGM
//CTLIN    DD *
LOADPGM1
/*
//STEP020  EXEC PGM=IEBCOPY
//SYSPRINT DD SYSOUT=*
//         ENDIF
