       IDENTIFICATION DIVISION.
       PROGRAM-ID. XMLWEB.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-DOC      PIC X(4000).
       PROCEDURE DIVISION.
           EXEC CICS WEB RECEIVE INTO(WS-DOC) LENGTH(LENGTH OF WS-DOC)
           END-EXEC
           XML PARSE WS-DOC PROCESSING PROCEDURE HANDLER
             ON EXCEPTION DISPLAY 'BAD'
           END-XML
           EXEC CICS RETURN END-EXEC.
       HANDLER.
           CONTINUE.
