       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELPER.
       DATA DIVISION.
       LINKAGE SECTION.
       01 LK-IDX           PIC 9(4).
       PROCEDURE DIVISION USING LK-IDX.
           DISPLAY LK-IDX
           GOBACK.
       END PROGRAM HELPER.
