       IDENTIFICATION DIVISION.
       PROGRAM-ID. MAINC.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-IN            PIC 9(4).
       PROCEDURE DIVISION.
           ACCEPT WS-IN FROM COMMAND-LINE
           CALL 'HELPER' USING WS-IN
           GOBACK.
