         PCB   TYPE=DB,DBDNAME=ORDERDB,PROCOPT=G,KEYLEN=10
         SENSEG NAME=ORDER
         SENSEG NAME=ITEM,PARENT=ORDER
         PSBGEN PSBNAME=ORDRPT,LANG=COBOL
         END
